Revit 2027 API
DrawContext.SetWorldTransform Method
 Sets the world transformation that will be applied to geometry during rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetWorldTransform(
	Transform trf
)
Public Shared Sub SetWorldTransform (
	trf As Transform
)
public:
static void SetWorldTransform(
	Transform^ trf
)
static member SetWorldTransform :
        trf : Transform -> unit
Parameters
trf Transform
 The transformation matrix.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace